# Ejemplo practico para pandas con dataframes

## 1. Inspeccion inicial del DataFrame

In [2]:
# Importacion de librerias
import pandas as pd

In [3]:
# Crear un DataFrame a partir de un diccionario
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Lucia', 'Marta', 'Jorge', 'Sofia'],
    'Edad':[23, 35, 45, 25, 30, 28, 32],
    'Ciudad':['CDMX', 'Guadalajara', 'Monterrey', 'CDMX', 'Puebla', 'CDMX', 'Guadalajara'],
    'Salario':[12000, 15000, 18000, 12500, 14000, 13000, 15500],
    'Departamento':['Ventas', 'Marketing', 'Ventas', 'TI', 'TI', 'Marketing', 'Ventas']
}

In [4]:
df = pd.DataFrame(data)
df

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
1    Luis    35  Guadalajara    15000    Marketing
2  Carlos    45    Monterrey    18000       Ventas
3   Lucia    25         CDMX    12500           TI
4   Marta    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas

## 2. Estructura y resumen del dataframe

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        7 non-null      object
 1   Edad          7 non-null      int64
 2   Ciudad        7 non-null      object
 3   Salario       7 non-null      int64
 4   Departamento  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [6]:
df.describe()

            Edad       Salario
count   7.000000      7.000000
mean   31.142857  14285.714286
std     7.335498   2078.804602
min    23.000000  12000.000000
25%    26.500000  12750.000000
50%    30.000000  14000.000000
75%    33.500000  15250.000000
max    45.000000  18000.000000

In [ ]:
#Muestra el numero de las filas
df.shape[0]

7

In [ ]:
# Muestra el numero de las columnas
df.shape[1]

5

In [7]:
# Muestras lo tipos dde datos de las columnas
df.dtypes

Nombre          object
Edad             int64
Ciudad          object
Salario          int64
Departamento    object
dtype: object

In [ ]:
# Muestra el nombre de las columnas que tengo
df.columns

Index(['Nombre', 'Edad', 'Ciudad', 'Salario', 'Departamento'], dtype='object')

In [9]:
# Los indices
df.index

RangeIndex(start=0, stop=7, step=1)

## 3. Seleccion de columnas y filas

In [13]:
# Selecciona una sola columna del dataframe como una serie
df['Edad']

0    23
1    35
2    45
3    25
4    30
5    28
6    32
Name: Edad, dtype: int64

In [15]:
type(df['Edad'])

pandas.core.series.Series

In [14]:
df[['Edad']]

   Edad
0    23
1    35
2    45
3    25
4    30
5    28
6    32

In [16]:
type(df[['Edad']])

pandas.core.frame.DataFrame

In [19]:
df[['Nombre', 'Salario', 'Departamento']]

   Nombre  Salario Departamento
0     Ana    12000       Ventas
1    Luis    15000    Marketing
2  Carlos    18000       Ventas
3   Lucia    12500           TI
4   Marta    14000           TI
5   Jorge    13000    Marketing
6   Sofia    15500       Ventas

## 4. Filtrado de filas

In [23]:
# Filtrar todas las filas, que la ciudad sea CDMX
df[df['Ciudad'] == 'CDMX']

  Nombre  Edad Ciudad  Salario Departamento
0    Ana    23   CDMX    12000       Ventas
3  Lucia    25   CDMX    12500           TI
5  Jorge    28   CDMX    13000    Marketing

In [25]:
df[df['Ciudad'] == 'CDMX'][['Nombre', 'Ciudad', 'Salario']]

  Nombre Ciudad  Salario
0    Ana   CDMX    12000
3  Lucia   CDMX    12500
5  Jorge   CDMX    13000

In [26]:
df_cdmx = df[df['Ciudad'] == 'CDMX']

In [27]:
df_cdmx[['Nombre', 'Ciudad', 'Salario']]

  Nombre Ciudad  Salario
0    Ana   CDMX    12000
3  Lucia   CDMX    12500
5  Jorge   CDMX    13000

In [32]:
# Mostrar todas las filas de la CDMX  y del departamento de TI

df[(df['Ciudad'] == 'CDMX') & (df['Departamento'] == 'TI')]

  Nombre  Edad Ciudad  Salario Departamento
3  Lucia    25   CDMX    12500           TI

In [35]:
# Mostrar todas las filas de la CDMX  o del departamento de TI

df[(df['Ciudad'] == 'CDMX') | (df['Departamento'] == 'TI')]

  Nombre  Edad  Ciudad  Salario Departamento
0    Ana    23    CDMX    12000       Ventas
3  Lucia    25    CDMX    12500           TI
4  Marta    30  Puebla    14000           TI
5  Jorge    28    CDMX    13000    Marketing

In [ ]:
# Ordena por salario de forma ascendente (a - z, 0-9)
df.sort_values(by='Salario', ascending=True)

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marketing
4   Marta    30       Puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas

In [38]:
# Ordena por salario de forma descenddente (z - a, 9-0)
df.sort_values(by='Salario', ascending=False)

   Nombre  Edad       Ciudad  Salario Departamento
2  Carlos    45    Monterrey    18000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    35  Guadalajara    15000    Marketing
4   Marta    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000    Marketing
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas

In [40]:
df.sort_values(by=['Ciudad', 'Salario'], ascending=[True, True])

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marketing
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas
4   Marta    30       Puebla    14000           TI

In [39]:
df.sort_values(by=['Ciudad', 'Salario'], ascending=[False, False])

   Nombre  Edad       Ciudad  Salario Departamento
4   Marta    30       Puebla    14000           TI
2  Carlos    45    Monterrey    18000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    35  Guadalajara    15000    Marketing
5   Jorge    28         CDMX    13000    Marketing
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas

In [41]:
df[(df['Ciudad'] == 'CDMX') | (df['Departamento'] == 'TI')].sort_values(by=['Edad', 'Departamento'], ascending=[True, False])

  Nombre  Edad  Ciudad  Salario Departamento
0    Ana    23    CDMX    12000       Ventas
3  Lucia    25    CDMX    12500           TI
5  Jorge    28    CDMX    13000    Marketing
4  Marta    30  Puebla    14000           TI

## 6. Crear nuevas columnas

In [42]:
df['SalarioAnual'] = df['Salario'] * 12

In [43]:
df

   Nombre  Edad       Ciudad  Salario Departamento  SalarioAnual
0     Ana    23         CDMX    12000       Ventas        144000
1    Luis    35  Guadalajara    15000    Marketing        180000
2  Carlos    45    Monterrey    18000       Ventas        216000
3   Lucia    25         CDMX    12500           TI        150000
4   Marta    30       Puebla    14000           TI        168000
5   Jorge    28         CDMX    13000    Marketing        156000
6   Sofia    32  Guadalajara    15500       Ventas        186000